DimasFNugroho/black-mata/firmware/esp32_hci/sdkconfig.defaults
# sdkconfig.defaults — ESP32-C6 BLE HCI controller firmware
#
# Applied on top of ESP-IDF defaults on first "idf.py build"
# (or after "idf.py fullclean").
#
# ESP32-C6 uses CONFIG_BT_CTRL_* option names — different from the original
# ESP32 which uses CONFIG_BTDM_CTRL_*. Do not mix the two.
#
# Requires ESP-IDF v5.0 or later (ESP32-C6 support was added in v5.0).

# ── Target ────────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32c6"

# ── Bluetooth controller ──────────────────────────────────────────────────────

CONFIG_BT_ENABLED=y

# ESP32-C6 is BLE-only (no Classic BT / BR/EDR)
CONFIG_BT_BLE_ENABLED=y

# HCI transport: UART H4 on UART0, 115200 baud, no hardware flow control.
# UART0 is exposed through the CH343 USB-serial chip on the devkit, so a
# plain USB cable to the Jetson is all that is needed.
CONFIG_BT_CTRL_HCI_MODE_UART_H4=y
CONFIG_BT_CTRL_HCI_UART_NO=0
CONFIG_BT_CTRL_HCI_UART_BAUDRATE=115200
CONFIG_BT_CTRL_HCI_UART_FLOW_CTRL_ENABLE=n

# No host stack on the ESP32-C6 — Linux (bluetoothd) is the host.
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=n

# ── WiFi off — frees memory for BT ───────────────────────────────────────────
CONFIG_ESP_WIFI_ENABLED=n
